Revit 2027 API
SpatialFieldManager.GetMinimum Method
 Calculates the minimum value for all primitives
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetMinimum(
	int resultIndex,
	bool rawValue
)
Public Function GetMinimum (
	resultIndex As Integer,
	rawValue As Boolean
) As Double
public:
double GetMinimum(
	int resultIndex,
	bool rawValue
)
member GetMinimum :
        resultIndex : int *
        rawValue : bool -> float
Parameters
resultIndex Int32
 Index of result schema
rawValue Boolean
 If true returned value is NOT multiplied by the current result's units multiplier, otherwise it IS
Return Value
Double
 Resulting minimum value
Exceptions
Exception | Condition
InapplicableDataException |  Thrown when current measurement is >= the number of measurements for at least one primitive
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace